research/logs/log-2021-02-01.tex
% Created 2021-02-07 Sun 17:59
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Sam Barrett}
\date{\today}
\title{Log: Week 1}
\hypersetup{
 pdfauthor={Sam Barrett},
 pdftitle={Log: Week 1},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.1 (Org mode 9.5)}, 
 pdflang={English}}
\begin{document}

\maketitle
This week I have:

\begin{itemize}
\item Re-familiarised myself with my code base \& what I have implemented up until to now
\item Implemented a linear ranked selection function of the same shape as the existing roulette wheel (fitness proportional) selection.
\begin{itemize}
\item I have also reworked the \texttt{GA} and \texttt{CGA} function types to allow for specification of selection operator and ranking function of \texttt{ranked\_selection}.
\end{itemize}
\item Working on parellelising \texttt{bezInt} function, currently runs \texttt{async} allowing for better average case runtime but running on multiple threads will increase speedup further. Currently this method alone results in a \textasciitilde{}50x slowdown!
\end{itemize}
\end{document}
